TurnosUC/app/controllers/chats_controller.rb

  def create
    @chat = Chat.new(chat_params)
    @chat.publication_id = @user.id
    @chat.user_id = current_user.id
    if @chat.save
---
INSERT INTO "chats" ("texto", "publication_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["texto", "fasdsa"], ["publication_id", 4], ["user_id", 4], ["created_at", "2022-06-15 16:54:28.283757"], ["updated_at", "2022-06-15 16:54:28.283757"]]

  def update
    @chat = Chat.find(params[:id])
    if @chat.update(chat_params)
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "chats" SET "texto" = $1, "updated_at" = $2 WHERE "chats"."id" = $3  [["texto", "fff"], ["updated_at", "2022-06-15 18:43:31.731292"], ["id", 2]]

  def delete
    @chat = Chat.find(params[:id])
    @chat.destroy
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 1]]