TurnosUC/app/controllers/criticas_controller.rb

INSERT INTO "criticas" ("rating", "comment", "created_at", "updated_at", "user_id", "publication_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 0], ["comment", "sd"], ["created_at", "2022-05-30 02:39:27.663144"], ["updated_at", "2022-05-30 02:39:27.663144"], ["user_id", 4], ["publication_id", 8]]
---
  def create
    @critica = Critica.new(critica_params)
    @critica.publication_id = @publication.id
    @critica.user_id = current_user.id
    if @critica.save

SELECT "criticas".* FROM "criticas" WHERE "criticas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "criticas" SET "comment" = $1, "updated_at" = $2 WHERE "criticas"."id" = $3  [["comment", "12"], ["updated_at", "2022-05-21 06:09:30.573854"], ["id", 2]]
---
  def update
    @critica = Critica.find(params[:id])
    if @critica.update(critica_params)

SELECT "criticas".* FROM "criticas" WHERE "criticas"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "criticas" WHERE "criticas"."id" = $1  [["id", 6]]
---
  def destroy
    @critica = Critica.find(params[:id])
    @critica.destroy

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_publication
    @publication = Publication.find(params[:publication_id])

SELECT "criticas".* FROM "criticas" WHERE "criticas"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def find_critica
    @critica = Critica.find(params[:id])