TurnosUC/app/controllers/publications_controller.rb

  def index
    if params[:category].blank?
      @publications = Publication.all
    else
      @category_id = Category.find_by(name: params[:category]).id
      @publications = Publication.where(category_id: @category_id)
---
SELECT "categories".* FROM "categories"
SELECT "publications".* FROM "publications"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Ida"], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."category_id" = $1  [["category_id", 1]]

  def show
    @average_critica = if @publication.criticas.blank?
                         0
                       else
                         @publication.criticas.average(:rating).round(2)
---
SELECT AVG(critica) FROM "criticas" WHERE "criticas"."publication_id" = $1  [["publication_id", 4]]
SELECT "criticas".* FROM "criticas" WHERE "criticas"."publication_id" = $1  [["publication_id", 1]]
SELECT AVG("criticas"."rating") FROM "criticas" WHERE "criticas"."publication_id" = $1  [["publication_id", 1]]

  def new
    @publication = current_user.publications.build
    @categories = Category.all.map { |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

  def create
    @publication = current_user.publications.build(publication_params)
    @publication.username = current_user.email
    @publication.user_id = current_user.id
    @publication.disponibilidad = @publication.disponibilidad.to_i
    @publication.category_id = params[:category_id]
    @publication.category_id = rand(1..2) if @publication.category_id.blank?
    if @publication.save!
---
SELECT "categories".* FROM "categories"
INSERT INTO "publications" ("lugar_origen", "lugar_destino", "disponibilidad", "comentarios", "created_at", "updated_at", "user_id", "username", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @publication = Publication.find(params[:id])
    @publication.category_id = 1
    @publication.category_id = rand(1..2) if @publication.category_id.blank?
    if @publication.update(publication_params)
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "publications" SET "comentarios" = $1, "updated_at" = $2 WHERE "publications"."id" = $3  [["comentarios", "Tarde!!!"], ["updated_at", "2022-06-06 20:38:13.889790"], ["id", 8]]

  def delete
    @publication = Publication.find(params[:id])
    @publication.destroy
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 7]]

  def find_publication
    @publication = Publication.find(params[:id])
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]