TurnosUC/app/controllers/solicituds_controller.rb

INSERT INTO "solicituds" ("comentario", "estado", "user_id", "publication_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comentario", "porfaaa"], ["estado", "En espera"], ["user_id", 5], ["publication_id", 7], ["created_at", "2022-05-21 04:01:00.821723"], ["updated_at", "2022-05-21 04:01:00.821723"]]
---
  def create
    @solicitud = Solicitud.new(solicitud_params)
    @solicitud.publication_id = @publication.id
    @solicitud.user_id = current_user.id
    if @solicitud.save

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "solicituds" SET "comentario" = $1, "updated_at" = $2 WHERE "solicituds"."id" = $3  [["comentario", "fdsfsapot"], ["updated_at", "2022-05-21 04:25:40.666006"], ["id", 3]]
UPDATE "solicituds" SET "comentario" = $1, "updated_at" = $2 WHERE "solicituds"."id" = $3  [["comentario", "ssssaaa"], ["updated_at", "2022-05-30 02:49:35.459434"], ["id", 4]]
---
  def update
    @solicitud = Solicitud.find(params[:id])
    if Publication.find(@solicitud.publication_id).user_id == current_user.id
      if @solicitud.update(params.permit(:estado))
        redirect_to publication_path(@publication)
      else
        render 'new'
      end
    elsif @solicitud.update(params.require(:solicitud).permit(:estado, :comentario))

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "solicituds" WHERE "solicituds"."id" = $1  [["id", 9]]
---
  def delete
    @solicitud = Solicitud.find(params[:id])
    @solicitud.destroy

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_publication
    @publication = Publication.find(params[:publication_id])

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_solicitud
    @solicitud = Solicitud.find(params[:id])