TurnosUC/app/views/chats/edit.html.erb

SELECT "chats".* FROM "chats"
---

<% Chat.all.each do |chat| %>