TurnosUC/app/views/chats/new.html.erb


    <% Chat.all.each do |chat| %>
---
SELECT "chats".* FROM "chats"