TurnosUC/app/views/solicituds/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---

<% if Publication.find(@solicitud.publication_id).user_id == current_user.id %>