TurnosUC/app/views/solicituds/show.html.erb

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."publication_id" = $1  [["publication_id", 7]]
---
  </tr>
    <% @publication.solicituds.each do |solicitud|%>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <td><%= solicitud.estado %></td>
    <td><%= User.find(solicitud.user_id).username %></td>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            </td>
        <% elsif Publication.find(solicitud.publication_id).user_id == current_user.id %>